import random


def generate_random_quote():
    """
        здесь собраны лучшие цитаты Стетхема
    :return:
    """
    list_quotes = ["Если заблудился в лесу, иди домой.",
                   "Делай, как надо. Как не надо, не делай.",
                   "Как говорил мой дед, «Я твой дед».",
                   "Если тебе где-то не рады в рваных носках, то и в целых туда идти не стоит.",
                   "Чак Норрис не здоров как бык, это бык здоров как Чак Норрис.",
                   "Жи-ши пиши от души.",
                   "Я вообще делаю что хочу. Хочу импланты — звоню врачу.",
                   "«В жизни всегда есть две дороги: одна — первая, а другая — вторая»;",
                   "«Работа — это не волк, работа — ворк. А волк — это ходить»;"]

    idx = random.randint(0, len(list_quotes) - 1)

    return list_quotes[idx]


def quote_the_day():
    pass
